/**
 * @project junior
 * @author Dmitry Cherutsa on 12.02.2017.
 * @version $Id$
 * @since 0.1
 * FileManager - пакет реализующий
 * выполнение задачи:
 * 1. Разработать клиент серверное приложение на сокетах.
 * 2. Серверная часть должна реализовывать следующее апи
 * - получить список корневого каталога. Корневой каталог задается при запуске сервера.
 * - перейти в подкаталог.
 * - спуститься в родительский каталог
 * - скачать файл
 * - загрузить файл.
 * 3. Клиент должен это апи уметь вызывать.
 * <p>
 * 4. настройки портов и адреса считывать с app.properties
 */
package ru.chedmitriy.socket.filemanager;